ibrahim_folder/cases/fan_0_old_mesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
43136
(
(-0.725103 0.276762 1.19986)
(-0.539873 0.402175 1.24487)
(-0.248118 0.316358 0.981897)
(-0.713719 0.315561 1.2445)
(-0.764985 0.387775 1.33118)
(-0.555501 0.35349 1.1509)
(-0.874706 0.336744 1.27286)
(-0.507111 0.15587 0.986104)
...
)
;

boundaryField
{
    walls
    {
        type            noSlip;
    }
    pressure_outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
1888
(
(0.176264 0.504059 1.12868)
(0.44453 0.349043 1.13027)
(0.672683 1.04443 1.66273)
(0.665348 0.638147 1.30762)
(0.608448 0.383855 1.34792)
(0.807975 0.557929 1.72359)
(1.32712 0.85193 2.27557)
(0.964509 0.771705 1.83457)
...
)
;
    }
    velocity_inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
}


// ************************************************************************* //
