ibrahim_folder/cases/fan_0_old_mesh/0/k
FoamFile
{
     version 2.0;
     format ascii;
     class volScalarField;
     object k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0037500000000000007;

boundaryField
{
    defaultPatch
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
        value            uniform 1e-10;
    }
    velocity_inlet
    {
        type            fixedValue;
        value            uniform 0.0037500000000000007;
    }
    pressure_outlet
    {
        type            zeroGradient;
    }
}
