ibrahim_folder/cases/fan_0_old_mesh/0/omega
FoamFile
{
     version 2.0;
     format ascii;
     class volScalarField;
     object omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.3606797749979;

boundaryField
{
    defaultPatch
    {
        type            zeroGradient;
    }
    walls
    {
        type            omegaWallFunction;
        value            uniform 1e-10;
    }
    velocity_inlet
    {
        type            fixedValue;
        value            uniform 22.3606797749979;
    }
    pressure_outlet
    {
        type            zeroGradient;
    }
}
