ibrahim_folder/cases/fan_0_old_mesh/constant/RASProperties
FoamFile
{
      version 2.0;
      format ascii;
      class dictionary;
      location "constant";
      object RASProperties;
}

kOmegaSSTCoeffs
{
}
